packages/invoiced-support/docs/backend-dev/tests/Integrations/Intacct/xml/intacct_order_entry_invoice_importer/standard/intacct_invoices_2.xml

<?xml version="1.0" encoding="UTF-8"?>
<response>
    <control>
        <status>success</status>
        <senderid>Invoiced</senderid>
        <controlid>1536529231</controlid>
        <uniqueid>false</uniqueid>
        <dtdversion>3.0</dtdversion>
    </control>
    <operation>
        <authentication>
            <status>success</status>
            <userid>Guest</userid>
            <companyid>Invoiced-DEV SE</companyid>
            <sessiontimestamp>2018-09-09T14:40:32-07:00</sessiontimestamp>
        </authentication>
        <result>
            <status>success</status>
            <function>read</function>
            <controlid>ae96e261-4369-48b7-95ee-e2f311dce97c</controlid>
            <data listtype="sodocument" count="5">
                <sodocument>
                    <RECORDNO>456</RECORDNO>
                    <PRRECORDKEY>4567</PRRECORDKEY>
                    <DOCNO>INV-1012</DOCNO>
                    <CURRENCY>USD</CURRENCY>
                    <WHENPOSTED>2017-01-12</WHENPOSTED>
                    <WHENDUE>2017-02-11</WHENDUE>
                    <TRX_TOTALPAID>2.51</TRX_TOTALPAID>
                    <TERM>
                        <NAME>NET 30</NAME>
                    </TERM>
                    <MESSAGE>Testing</MESSAGE>
                    <PONUMBER>PO-123456789012345678901234567890</PONUMBER>
                    <CONTRACTID>483</CONTRACTID>
                    <CUSTREC>2</CUSTREC>
                    <CUSTVENDID>self::$customer->number</CUSTVENDID>
                    <CUSTVENDNAME>self::$customer->name</CUSTVENDNAME>
                    <SHIPTO>
                        <PRINTAS>Bojangle Jones</PRINTAS>
                        <MAILADDRESS>
                            <ADDRESS1>1234 Main St</ADDRESS1>
                            <ADDRESS2></ADDRESS2>
                            <CITY>Austin</CITY>
                            <STATE>TX</STATE>
                            <ZIP>78701</ZIP>
                            <COUNTRYCODE>US</COUNTRYCODE>
                        </MAILADDRESS>
                    </SHIPTO>
                    <SODOCUMENTENTRIES>
                        <sodocumententry>
                            <ITEMDESC>Marketing guides: </ITEMDESC>
                            <QUANTITY>5.5</QUANTITY>
                            <UIPRICE>72</UIPRICE>
                            <UIVALUE>396</UIVALUE>
                            <TRX_PRICE>144</TRX_PRICE>
                            <TRX_VALUE>792</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                        <sodocumententry>
                            <ITEMDESC>Contract discount test</ITEMDESC>
                            <QUANTITY>10.1234</QUANTITY>
                            <UIPRICE>72</UIPRICE>
                            <UIVALUE>721.31</UIVALUE>
                            <TRX_PRICE>144</TRX_PRICE>
                            <TRX_VALUE>1442.62</TRX_VALUE>
                            <MULTIPLIER>2</MULTIPLIER>
                        </sodocumententry>
                    </SODOCUMENTENTRIES>
                    <SUBTOTALS>
                        <sodocumentsubtotals>
                            <RECORDNO>1</RECORDNO>
                            <DESCRIPTION>Sales Tax</DESCRIPTION>
                            <TOTAL>20</TOTAL>
                            <TRX_TOTAL>40</TRX_TOTAL>
                        </sodocumentsubtotals>
                    </SUBTOTALS>
                </sodocument>
                <sodocument>
                    <RECORDNO>165</RECORDNO>
                    <PRRECORDKEY>1657</PRRECORDKEY>
                    <DOCNO>INV-0264</DOCNO>
                    <CURRENCY>USD</CURRENCY>
                    <WHENPOSTED>2015-12-04</WHENPOSTED>
                    <WHENDUE>2015-12-07</WHENDUE>
                    <TRX_TOTALPAID>0</TRX_TOTALPAID>
                    <TERM></TERM>
                    <MESSAGE></MESSAGE>
                    <PONUMBER></PONUMBER>
                    <CONTRACTID></CONTRACTID>
                    <CUSTREC>4</CUSTREC>
                    <CUSTVENDID>CUST-0002</CUSTVENDID>
                    <CUSTVENDNAME>Test 2</CUSTVENDNAME>
                    <SHIPTO>
                        <PRINTAS>Test 2</PRINTAS>
                        <MAILADDRESS>
                            <ADDRESS1></ADDRESS1>
                            <ADDRESS2></ADDRESS2>
                            <CITY></CITY>
                            <STATE></STATE>
                            <ZIP></ZIP>
                            <COUNTRYCODE></COUNTRYCODE>
                        </MAILADDRESS>
                    </SHIPTO>
                    <SODOCUMENTENTRIES>
                        <sodocumententry>
                            <ITEMDESC>Some Item</ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>50</UIPRICE>
                            <UIVALUE>50</UIVALUE>
                            <TRX_PRICE>100</TRX_PRICE>
                            <TRX_VALUE>100</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                        <sodocumententry>
                            <ITEMDESC>Line 2: </ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>35</UIPRICE>
                            <UIVALUE>35</UIVALUE>
                            <TRX_PRICE>70</TRX_PRICE>
                            <TRX_VALUE>70</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                    </SODOCUMENTENTRIES>
                    <SUBTOTALS>
                        <sodocumentsubtotals>
                            <RECORDNO>1</RECORDNO>
                            <DESCRIPTION>Discount: </DESCRIPTION>
                            <TOTAL>-35</TOTAL>
                            <TRX_TOTAL>-70</TRX_TOTAL>
                        </sodocumentsubtotals>
                    </SUBTOTALS>
                </sodocument>
                <sodocument>
                    <RECORDNO>109</RECORDNO>
                    <PRRECORDKEY>1097</PRRECORDKEY>
                    <DOCNO>INV-0223</DOCNO>
                    <CURRENCY>USD</CURRENCY>
                    <WHENPOSTED>2015-09-21</WHENPOSTED>
                    <WHENDUE>2015-09-24</WHENDUE>
                    <TRX_TOTALPAID>0</TRX_TOTALPAID>
                    <TERM></TERM>
                    <MESSAGE></MESSAGE>
                    <PONUMBER></PONUMBER>
                    <CONTRACTID></CONTRACTID>
                    <CUSTREC>3</CUSTREC>
                    <CUSTVENDID>C-3</CUSTVENDID>
                    <CUSTVENDNAME>After</CUSTVENDNAME>
                    <SHIPTO>
                        <PRINTAS></PRINTAS>
                        <MAILADDRESS>
                            <ADDRESS1></ADDRESS1>
                            <ADDRESS2></ADDRESS2>
                            <CITY></CITY>
                            <STATE></STATE>
                            <ZIP></ZIP>
                            <COUNTRYCODE></COUNTRYCODE>
                        </MAILADDRESS>
                    </SHIPTO>
                    <SODOCUMENTENTRIES>
                        <sodocumententry>
                            <ITEMDESC>Development work - develper onsite per day: </ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>1280</UIPRICE>
                            <UIVALUE>1280</UIVALUE>
                            <TRX_PRICE>2560</TRX_PRICE>
                            <TRX_VALUE>2560</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                    </SODOCUMENTENTRIES>
                    <SUBTOTALS>
                        <sodocumentsubtotals>
                            <RECORDNO>1</RECORDNO>
                            <DESCRIPTION></DESCRIPTION>
                            <TOTAL>0</TOTAL>
                            <TRX_TOTAL>0</TRX_TOTAL>
                        </sodocumentsubtotals>
                    </SUBTOTALS>
                </sodocument>
                <sodocument>
                    <RECORDNO>120</RECORDNO>
                    <PRRECORDKEY>120</PRRECORDKEY>
                    <DOCNO>INV-0120</DOCNO>
                    <CURRENCY>USD</CURRENCY>
                    <WHENPOSTED>2015-09-21</WHENPOSTED>
                    <WHENDUE>2015-09-24</WHENDUE>
                    <TRX_TOTALPAID>0</TRX_TOTALPAID>
                    <TERM></TERM>
                    <MESSAGE></MESSAGE>
                    <PONUMBER></PONUMBER>
                    <CONTRACTID></CONTRACTID>
                    <CUSTREC>4</CUSTREC>
                    <CUSTVENDID>CUST-0002</CUSTVENDID>
                    <CUSTVENDNAME>Test 2</CUSTVENDNAME>
                    <SHIPTO>
                        <PRINTAS>Test 2</PRINTAS>
                        <MAILADDRESS>
                            <ADDRESS1></ADDRESS1>
                            <ADDRESS2></ADDRESS2>
                            <CITY></CITY>
                            <STATE></STATE>
                            <ZIP></ZIP>
                            <COUNTRYCODE></COUNTRYCODE>
                        </MAILADDRESS>
                    </SHIPTO>
                    <SODOCUMENTENTRIES>
                        <sodocumententry>
                            <ITEMDESC>Line 1</ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>35</UIPRICE>
                            <UIVALUE>35</UIVALUE>
                            <TRX_PRICE>70</TRX_PRICE>
                            <TRX_VALUE>70</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                        <sodocumententry>
                            <ITEMDESC>Line 2</ITEMDESC>
                            <QUANTITY>10</QUANTITY>
                            <UIPRICE>34.9999997200</UIPRICE>
                            <UIVALUE>250</UIVALUE>
                            <TRX_PRICE>69.99999944</TRX_PRICE>
                            <TRX_VALUE>500</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                        <sodocumententry>
                            <ITEMDESC>Line 3</ITEMDESC>
                            <QUANTITY>30</QUANTITY>
                            <UIPRICE>34.9999995864</UIPRICE>
                            <UIVALUE>550</UIVALUE>
                            <TRX_PRICE>69.99999944</TRX_PRICE>
                            <TRX_VALUE>1100</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                        <sodocumententry>
                            <ITEMDESC>Line 4</ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>251</UIPRICE>
                            <UIVALUE>251</UIVALUE>
                            <TRX_PRICE>502</TRX_PRICE>
                            <TRX_VALUE>502</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                    </SODOCUMENTENTRIES>
                    <SUBTOTALS>
                        <sodocumentsubtotals>
                            <RECORDNO>1</RECORDNO>
                            <DESCRIPTION></DESCRIPTION>
                            <TOTAL>0</TOTAL>
                            <TRX_TOTAL>0</TRX_TOTAL>
                        </sodocumentsubtotals>
                    </SUBTOTALS>
                </sodocument>
                <sodocument>
                    <RECORDNO>150</RECORDNO>
                    <PRRECORDKEY>1507</PRRECORDKEY>
                    <DOCNO></DOCNO>
                    <CURRENCY>USD</CURRENCY>
                    <WHENPOSTED>2015-09-21</WHENPOSTED>
                    <WHENDUE>2015-09-24</WHENDUE>
                    <TRX_TOTALPAID>0</TRX_TOTALPAID>
                    <TERM></TERM>
                    <MESSAGE></MESSAGE>
                    <PONUMBER></PONUMBER>
                    <CONTRACTID></CONTRACTID>
                    <CUSTREC>3</CUSTREC>
                    <CUSTVENDID>C-3</CUSTVENDID>
                    <CUSTVENDNAME>After</CUSTVENDNAME>
                    <SHIPTO>
                        <PRINTAS></PRINTAS>
                        <MAILADDRESS>
                            <ADDRESS1></ADDRESS1>
                            <ADDRESS2></ADDRESS2>
                            <CITY></CITY>
                            <STATE></STATE>
                            <ZIP></ZIP>
                            <COUNTRYCODE></COUNTRYCODE>
                        </MAILADDRESS>
                    </SHIPTO>
                    <SODOCUMENTENTRIES>
                        <sodocumententry>
                            <ITEMDESC>Development work - develper onsite per day: </ITEMDESC>
                            <QUANTITY>1</QUANTITY>
                            <UIPRICE>1280</UIPRICE>
                            <UIVALUE>1280</UIVALUE>
                            <TRX_PRICE>2560</TRX_PRICE>
                            <TRX_VALUE>2560</TRX_VALUE>
                            <MULTIPLIER>1</MULTIPLIER>
                        </sodocumententry>
                    </SODOCUMENTENTRIES>
                    <SUBTOTALS>
                        <sodocumentsubtotals>
                            <RECORDNO>1</RECORDNO>
                            <DESCRIPTION></DESCRIPTION>
                            <TOTAL>0</TOTAL>
                            <TRX_TOTAL>0</TRX_TOTAL>
                        </sodocumentsubtotals>
                    </SUBTOTALS>
                </sodocument>
            </data>
        </result>
    </operation>
</response>